---
kind: property
id: P:Autodesk.Revit.DB.SymbolTypeId.Bar
source: html/e75fffc8-fc78-72ea-ebe3-7af80291c2eb.htm
---
# Autodesk.Revit.DB.SymbolTypeId.Bar Property

Symbol bar, indicating unit Bars.

## Syntax (C#)
```csharp
public static ForgeTypeId Bar { get; }
```